// 2. ให้สร้าง function ที่รับข้อมูลเป็น string '(', '[', '{', '}', ']', ')'
// ทำการตรวจสอบว่าข้อมูลที่รับมามีการเปิดปิดของสัญลักษณ์ครบคู่หรือไม่ เช่น
// ข้อมูล "()" คำตอบจะเป็น true เพราะมีการเปิดปิดวงเล็บครบคู่
// ข้อมูล "([{)" คำตอบจะเป็น false เพราะมีการเปิดปิดไม่ครบคู่
// ตัวอย่างผลลัพธิ์
// "()" =&gt; true
// "([]]" =&gt; false

function check(text) {
    const tmp  = text.split('');
    let f1=0, f2=0, f3=0, l1=0, l2=0, l3=0;
    for (const t of tmp){
        t==="(" && f1++;
        t==="[" && f2++;
        t==="{" && f3++;
        t===")" && l1++;
        t==="]" && l2++;
        t==="}" && l3++;
    }
    
    if((f1===l1)&&(f2===l2)&&(f3===l3)){
        return true
    } else return false
}

console.log(check('{{{((()))}}]}['))