// 4. จงเขียนโปรแกรมเพื่อหาคำตอบของจำนวนบวกต่อเนื่องกันตั้งแต่ n ถึง m โดยโจทย์จะกำหนดตัวแปร
// n และ m มาให้
// ตัวอย่างเช่น
// n =1,m =5 คือการหาผลรวมของ 1, 2, 3, 4,5 ผลลัพธ์คือ 15
// n=3, m=5 คือการหาผลรวมของ 3, 4,5 ผลลัพธ์เท่ากับ 12 จงเขียนโปรแกรมเพื่อหาผลลัพธ์ต่อไปนี้

// c. n=1 m =99
// d. n = 446 m = 779
// e. n=3 m=1,099
// f. n=34 m= 1,000,000

function add1(n,m) {
    let count = 0;
    for(i=0; i<(m-n)+1; i++){
        // console.log(i)
        count = count+(n+i)
        // console.log(count)
    }
    return count
}

function add2(n,m){
    return ((m-n+1)/2)*(n+m)
}

console.log(add1(3,6))
console.log(add2(3,6))