// 6. เลือกหยิบกองเหรียญทอง
// เกมส์ชิงรางวัลเกมส์หนึ่ง มีปัญหาอยู่ว่า มีกองเหรียญทองกับกองเหรียญตะกั่ววางเรียงกันอยู่หลายกอง
// แต่ละกองมีจำนวนกองละกี่เหรียญก็ได้ อาจจะมีกี่กองก็ได้วางเรียงกันแล้วแต่ผู้ดำเนินเกมส์นั้นจะจัดให้
// ให้ผู้เข้าแข่งขันเลือกหยิบกองเหรียญกี่กองก็ได้ที่อยู่ต่อเนื่องกัน
// โดยรางวัลที่ผู้เข้าแข่งขันจะได้รับเหรียญทองซึ่งเป็นจำนวนของเหรียญทองที่ลบด้วยจำนวนเหรียญตะกั่ว
// ตัวอย่างเช่น ให้ เลขจำนวนเต็มบวกเป็นจำนวนเหรียญในกองเหรียญทอง
// จำนวนเต็มลบเป็นจำนวนเหรียญตะกั่วในกองเหรียญตะกั่ว แล้วผู้ดำเนินเกมส์จัดวางกองเหรียญดังนี้
// 1 3 -2 -5 8 -1
// คำตอบของโจทย์นี้ คือ เลือกกองที่ 5 กองเดียว ได้ 8 เหรียญทอง

function selectGoldCoin(arr){
    var max1 = Math.max(...arr);
    var maxIndex1 = arr.findIndex((e) => e === max1);
    let tmp=[];
    let sum = 0;
    let result = {from: maxIndex1+1, to: maxIndex1+1, gold: max1}
    for(a of arr){
        sum = sum + a;
        tmp.push(sum);
    }
    var max2 = Math.max(...tmp);
    var maxIndex2 = tmp.findIndex((e) => e === max2)
    if(max1<max2){
        result.from = 1;
        result.to = maxIndex2+1;
        result.gold = max2;
    }
    return result;
}

console.log(selectGoldCoin([1,3,-2,-5,8,-1]))
console.log(selectGoldCoin([3,4,-2,6,7,-3,-5]))